Revit 2027 API
ParameterTypeId.MaterialParamSmoothness Property
 "Smoothness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialParamSmoothness { get; }
Public Shared ReadOnly Property MaterialParamSmoothness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialParamSmoothness {
	ForgeTypeId^ get ();
}
static member MaterialParamSmoothness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace